{"2.-Build-a-Record-Triggered-Flows":{"slug":"2.-Build-a-Record-Triggered-Flows","filePath":"2. Build a Record-Triggered Flows.md","title":"Build a Record-Triggered Flows","links":[],"tags":[],"content":"\nDefine the key components used to create a record-triggered process.\nDescribe when to use Fast Field Updates.\nDescribe when to use Actions and Related Records.\nIdentify options for when to run a flow when a record is updated.\nBuild a flow that creates a draft contract based on a change in the opportunity.\n\n\n\nBusiness Requirement\n\n\n\nPlan and Explain your Flow\nConsider these questions and use the Description fields in your flow.\n\nDoes the flow run immediately or is it scheduled?\nDoes the flow create another record or just update a record?\nDoes the flow run every time a record is updated or only the first time its criteria are met?\n\n\n\nConfigure Start\nSetup → Flows → Start from Scratch → Record-Triggered Flow\n\n\nDefine the Trigger\n\n\nCreate a New Record\non the path after the Start element, click +\nclick create records\n\n\nSave and Debug\nBest practice to save your flow often and debug immediately after completing it.\n\n\nwhat I learned\n*Record\nA single row of data -  an individual data instance saved in an Object.\nExamples.\n\na customer information → Account record\na deal or transaction → Opportunity record\na contract → Contract record\n\n*Record-triggered flow \nAn automated process that executes actions when record is created, updated, or deleted.  It listens for changes and performs specific actions in response.\nFast Field Updates\nIf you’re trying to update the ==record that triggered the flow, then you should optimize the flow using Fast Field Updates. A flow using Fast Field Updates runs before the record is saved to the database.==\n→ It ensures that any automation logic is reflected in the saved data\nEasier Way to Think!\n1. You changed the stage of Opportunity to “Proposal/Price Quote”\n2. The system says “Hold on, before saving this, I need to run some automation!”\n(This is a the Record -Triggered Flow, and more specifically, a Fast Field Update flow runs first.)\n(Because there might be something that needs to be changed before save the Opportunity is saved.)\n3. Now let the flow runs.\n(For example, it might automatically crate a draft Contract record.)\n4. Once all automation is done, the updated Opportunity is finally saved in the DB."},"index":{"slug":"index","filePath":"index.md","title":"Welcome","links":[],"tags":[],"content":"Hello\nThis is my Quartz homepage!"}}